Repository: open-contracting/cardinal-rs
Catalog: docs/locale/*/LC_MESSAGES/topics/workflow.po
Languages: es

source: Overall workflow
es: Flujo de trabajo general

source: This page describes the general workflow when using Cardinal.
es: Esta página describe el flujo de trabajo general al utilizar Cardinal.

source: 1. Collect data
es: (1) Obtener los datos

source: Collect the data you want to analyze in OCDS format.
es: Obtenga los datos que desea analizar en formato OCDS.

source: You can use the [OCP Data Registry](https://data.open-contracting.org) to download data from over 50 publishers. The Registry provides data as OCDS compiled releases in line-delimited JSON files (the same format expected by Cardinal).
es: Puede utilizar el [Registro de datos OCP](https://data.open-contracting.org) para descargar datos de más de 50 publicadores. El Registro proporciona datos como versiones compiladas de OCDS en archivos JSON delimitados por líneas (el mismo formato que espera Cardinal).

source: Is the data you're interested in not in OCDS format? Contact OCP's [Data Support Team](mailto:data@open-contracting.org) to see how we can help.
es: ¿Los datos que le interesan no están en formato OCDS? Póngase en contacto con el [Equipo de datos](mailto:data@open-contracting.org) de OCP para ver cómo podemos ayudarle.

source: 2. Prepare data
es: (2) Preparar los datos

source: Format
es: Formato

source: If you are *not* using data from the Registry, ensure that the [releases or records](https://standard.open-contracting.org/latest/en/primer/releases_and_records/) are merged into compiled releases, and that the compiled releases are upgraded to OCDS 1.1 (the version since 2017).
es: Si *no* utiliza datos del Registro, asegúrese de que las [entregas o registros](https://standard.open-contracting.org/latest/en/primer/releases_and_records/) se fusionan en versiones compiladas, y de que las versiones compiladas se actualizan a OCDS 1.1 (la versión desde 2017).

source: You can use [OCDS Kit](https://ocdskit.readthedocs.io/en/latest/)'s command-line interface to [compile](https://ocdskit.readthedocs.io/en/latest/cli/ocds.html#compile) and [upgrade](https://ocdskit.readthedocs.io/en/latest/cli/ocds.html#upgrade) the OCDS data.
es: Puede utilizar la interfaz de la línea de comando de [OCDS Kit](https://ocdskit.readthedocs.io/en/latest/)para [compilar](https://ocdskit.readthedocs.io/en/latest/cli/ocds.html#compile) y [actualizar](https://ocdskit.readthedocs.io/en/latest/cli/ocds.html#upgrade) los datos OCDS.

source: Quality
es: Calidad

source: For the indicator results to be reliable, the input data must be good quality.
es: Para que los resultados del indicador sean fiables, los datos de entrada deben ser de buena calidad.

source: You can use the {doc}`../cli/prepare` command to identify and correct quality issues.
es: Puede utilizar el comando {doc}`../cli/prepare` para identificar y corregir problemas de calidad.

source: 3. Explore data
es: (3) Explorar los datos

source: To inform your {ref}`selection and configuration<indicators-workflow>` of indicators, you can explore your data using JSON processors like [jaq](https://github.com/01mf02/jaq) (faster) or [jq](https://stedolan.github.io/jq/) (slower).
es: Para informar su {ref}`selección y configuración<indicators-workflow>` de indicadores, puede explorar sus datos utilizando procesadores JSON como [jaq](https://github.com/01mf02/jaq) (más rápido) o [jq](https://stedolan.github.io/jq/) (más lento).

source: For example, if the publisher uses `/tender/procurementMethodDetails` for the local name of the procurement method, you can count the occurrences of each procurement method with:
es: Por ejemplo, si el editor utiliza `/tender/procurementMethodDetails` para el nombre local del método de adquisición, puede contar las apariciones de cada método de adquisición con:

source: If the publisher uses a classification system for products and services, like UNSPSC or CPV, you can count the occurrences of each segment/division of the classification with:
es: Si el publicador utiliza un sistema de clasificación de productos y servicios, como UNSPSC o CPV, puede contar las apariciones de cada segmento/división de la clasificación con:

source: 4. Calculate indicators
es: (4) Calcular los indicadores

source: Use the {doc}`../cli/indicators/index` command to calculate procurement indicators and red flags.
es: Utilice le comando {doc}`../cli/indicators/index` para calcular los indicadores y banderas rojas.

source: Additional information on this step is provided in the [command's documentation](../cli/indicators/index).
es: Información adicional de este paso está disponible en la [documentación del comando](../cli/indicators/index).

source: 5. Analyze results
es: (5) Analizar los resultados

source: Coming soon
es: Próximamente

source: The Open Contracting Partnership is building business intelligence tools, using the indicator results from Cardinal.
es: La Open Contracting Partnership está creando herramientas de inteligencia de negocios a partir de los resultados de los indicadores de Cardinal.

source: Are you interested? Contact OCP's [Data Support Team](mailto:data@open-contracting.org).
es: ¿Está interesado? Contacte al [Equipo de datos de OCP](mailto:data@open-contracting.org).
