Repository: open-contracting/cardinal-rs
Catalog: docs/locale/*/LC_MESSAGES/cli/prepare.po
Languages: es

source: The `prepare` command corrects quality issues within OCDS compiled releases.
es: El comando `prepare` corrige problemas de calidad en las entregas compiladas de OCDS.

source: Run the `help` command to read its description, output format and options:
es: Ejecute el comando `help` para leer su descripción, formato de salida y opciones:

source: Workflow
es: Flujo de trabajo

source: Before following this command's workflow, follow the earlier steps in the {doc}`../../topics/workflow`.
es: Antes de seguir el flujo de trabajo de este comando, siga los pasos anteriores en el {doc}`../../topics/workflow`.

source: Initialize a `settings.ini` file, using the {doc}`init` command:
es: Inicialice un archivo `settings.ini`, usando el comando {doc}`init`:

source: Run the `prepare` command. For example, if your data is in `input.jsonl`, this command writes the corrected data to `prepared.jsonl` and the quality issues to `issues.csv`:
es: Ejecute el comando `prepare`. Por ejemplo, si sus datos están en `input.jsonl`, este comando escribe los datos corregidos en `prepared.jsonl` y los problemas de calidad en `issues.csv`:

source: Review the quality issues in the `issues.csv` file. Don't worry if many issues are reported: most are repetitive and can be fixed at once. Read the [demonstration](#demonstration) to learn how to interpret results.
es: Revise los problemas de calidad en el archivo `issues.csv`. No se preocupe si se notifican muchos problemas: la mayoría son repetitivos y pueden solucionarse de una vez. Lea la [demostración](#demonstration) para aprender a interpretar los resultados.

source: Adjust the [configuration](#configuration) in the `settings.ini` file to fix the quality issues.
es: Ajuste la [configuración](#configuration) en el archivo `settings.ini` para solucionar los problemas de calidad.

source: Repeat the last three steps until you are satisfied with the results.
es: Repita los 3 últimos pasos hasta que esté satisfecho con los resultados.

source: This command is designed to only warn about quality issues (1) that it can fix and (2) that interfere with the calculation of {doc}`indicators/index`. If you want to check for other quality issues, contact OCP's [Data Support Team](mailto:data@open-contracting.org) about [Pelican](https://www.open-contracting.org/2020/01/28/meet-pelican-our-new-tool-for-assessing-the-quality-of-open-contracting-data/).
es: Este comando está diseñado para advertir únicamente sobre problemas de calidad (1) que pueda solucionar y (2) que interfieran con el cálculo de {doc}`indicators/index`. Si desea comprobar otros problemas de calidad, póngase en contacto con el [Equipo de soporte de datos](mailto:data@open-contracting.org) de OCP para usar [Pelican](https://www.open-contracting.org/2020/01/28/meet-pelican-our-new-tool-for-assessing-the-quality-of-open-contracting-data/).

source: Demonstration
es: Demonstración

source: Example
es: Ejemplo

source: The bid status (`/bids/details[]/status`) is needed to determine whether a bid is {term}`submitted`, invited or withdrawn.
es: El estado de la oferta (`/bids/details[]/status`) es necesario para determinar si una oferta ha sido {term}`enviada<enviado>`, invitada o retirada.

source: This simplified file contains a bid without a status:
es: Este archivo simplificado contiene una oferta sin estado:

source: For this demonstration, write the quality issues to the console:
es: Para esta demostración, escriba los problemas de calidad en la consola:

source: Quality issues are reported as CSV rows. Adding a header and rendering the row as a table produces:
es: Los problemas de calidad se notifican como filas CSV. Si se añade un encabezado y se representa la fila como una tabla, se produce:

source: If you write the quality issues to a file instead of the console, you can open the CSV as a spreadsheet.
es: Si escribe los problemas de calidad en un archivo en lugar de en la consola, puede abrir el CSV como una hoja de cálculo.

source: Given the context of this example, the columns can be used as follows.
es: Teniendo en cuenta el contexto de este ejemplo, las columnas pueden utilizarse del siguiente modo.

source: Column
es: Columna

source: Use
es: Uso

source: Find the problematic compiled release in the input file.
es: Busque la entrega compilada problemática en el archivo de entrada.

source: Find the problematic compiled release in another system, like the data source.
es: Busque la entrega compilada problemática en otro sistema, como la fuente de datos.

source: Consult the field that has an issue. This column can be used to sort and filter the issues.
es: Consulte el campo que tiene un error. Esta columna puede utilizarse para ordenar y filtrar los errores.

source: Find the problematic array entry in the compiled release. If the *path* contains multiple arrays (`[]`), the indexes are separated by periods.
es: Encuentra el array problemático en la entrega compilada. Si la *ruta* contiene varios arrays (`[]`), los índices se separan por puntos.

source: Consult the value that caused the issue. If the issue is that the field isn't set, this is blank.
es: Consulte el valor que causó el problema. Si el problema es que el campo no está configurado, está en blanco.

source: Determine the potential solution to the issue. The possible values are:
es: Determine la posible solución al problema. Los valores posibles son:

source: Configuration
es: Configuración

source: Normalize ID fields
es: Normalizar campos de ID

source: Some ID fields allow both strings (`"1"`) and integers (`1`): for example, an award's `id` and a contract's `awardID`. If the types are inconsistent, then lookups fail: for example, retrieving a contract's award or a supplier's address.
es: Algunos campos ID admiten tanto cadenas (`"1"`) como números enteros (`1`): por ejemplo, el `id` de una adjudicación y el `awardID` de un contrato. Si los tipos son inconsistentes, las búsquedas fallan: por ejemplo, recuperar la adjudicación de un contrato o la dirección de un proveedor.

source: The command converts these ID fields to strings, in order to prevent this issue:
es: El comando convierte estos campos ID en cadenas, para evitar este problema:

source: As new indicators are added, additional ID fields will be converted.
es: A medida que se añadan nuevos indicadores, se convertirán los campos ID adicionales.

source: This behavior can't be disabled. If you need to disable it, [create an issue on GitHub](https://github.com/open-contracting/cardinal-rs/issues).
es: Este comportamiento no puede desactivarse. Si necesita desactivarlo, [cree un issue en GitHub](https://github.com/open-contracting/cardinal-rs/issues).

source: Fill in missing values
es: Llenar valores faltantes

source: The command supports filling in:
es: El comando permite rellenar:

source: To fill in one or more of these fields when the field isn't set, add a `[defaults]` section with relevant properties to your {doc}`../topics/settings`. For example:
es: Para rellenar uno o más de estos campos cuando el campo no está configurado, añada una sección `[defaults]` con las propiedades relevantes a su {doc}`../topics/settings`. Por ejemplo:

source: As new indicators are added, additional currency and scheme fields will be filled in.
es: A medida que se añadan nuevos indicadores, campos adicionales de moneda y esquema se rellenarán.

source: Need to fill in other values? [Create an issue on GitHub](https://github.com/open-contracting/cardinal-rs/issues), or [email James McKinney](mailto:jmckinney@open-contracting.org), OCP's Head of Technology.
es: ¿Necesita llenar otros valores? [Cree un issue en GitHub](https://github.com/open-contracting/cardinal-rs/issues), o [escriba a James McKinney](mailto:jmckinney@open-contracting.org), Head of Technology de OCP.

source: Redact incorrect values
es: Eliminar valores incorrectos

source: Need to redact other values? [Create an issue on GitHub](https://github.com/open-contracting/cardinal-rs/issues), or [email James McKinney](mailto:jmckinney@open-contracting.org), OCP's Head of Technology.
es: ¿Necesita eliminar otros valores? [Cree un issue en GitHub](https://github.com/open-contracting/cardinal-rs/issues), o [escriba a James McKinney](mailto:jmckinney@open-contracting.org), Head of Technology de OCP.

source: Monetary amounts
es: Montos monetatios

source: Indicators assume that amount values are accurate. If an amount field is assigned a placeholder value, this assumption fails. For example, if 0 is used when the amount is confidential or wasn't entered, then the lowest bids might be miscalculated.
es: Los indicadores asumen que los valores de importe son exactos. Si a un campo de importe se le asigna un valor de marcador, esta suposición falla. Por ejemplo, si se utiliza 0 cuando el importe es confidencial o no se ha introducido, las ofertas más bajas podrían calcularse erróneamente.

source: To redact an amount value, add a `[redactions]` section with an `amount` property to your {doc}`../topics/settings`. Its value is a pipe-separated list. For example:
es: Para eliminar un valor de cantidad, añada una sección `[redactions]` con una propiedad `amount` a su {doc}`../topics/settings`. Su valor es una lista separada por barras verticales ("|"). Por ejemplo:

source: This configuration supports redacting values from:
es: Esta configuración permite eliminar valores de:

source: Organization IDs
es: IDs de organizaciones

source: Indicators assume that ID values represent distinct entities. If an ID field is assigned a placeholder value, this assumption fails. For example, if the placeholder value is used frequently, then the top suppliers might be miscalculated.
es: Los indicadores asumen que los valores de ID representan entidades distintas. Si a un campo ID se le asigna un valor de marcador, esta suposición falla. Por ejemplo, si el valor del marcador se utiliza con frecuencia, los proveedores principales podrían estar mal calculados.

source: To redact an ID value from an organization reference, add a `[redactions]` section with an `organization_id` property to your {doc}`../topics/settings`. Its value is a pipe-separated list. For example:
es: Para eliminar un valor ID de una referencia de organización, añada una sección `[redactions]` con una propiedad `organization_id` a su {doc}`../topics/settings`. Su valor es una lista separada por barras verticales ("|"). Por ejemplo:

source: Re-map invalid codes
es: Re-mapear códigos inválidos

source: The command supports substituting codes in these codelist fields:
es: El comando permite sustituir códigos en estos campos de la lista de códigos:

source: `/bids/details[]/status`, by adding a `[codelists.bid_status]` section
es: `/bids/details[]/status`, agregando una sección `[codelists.bid_status]`

source: `/awards[]/status`, by adding a `[codelists.AwardStatus]` section
es: `/awards[]/status`, agregando una sección `[codelists.AwardStatus]`

source: To replace a code, add a property under the relevant section, in which the code to replace is the name, and its replacement is the value. For example:
es: Para sustituir un código, añada una propiedad en la sección correspondiente, en la que el código a sustituir sea el nombre, y su sustitución sea el valor. Por ejemplo:

source: Need to re-map other values? [Create an issue on GitHub](https://github.com/open-contracting/cardinal-rs/issues), or [email James McKinney](mailto:jmckinney@open-contracting.org), OCP's Head of Technology.
es: ¿Necesita mapear otros valores? [Cree un issue en GitHub](https://github.com/open-contracting/cardinal-rs/issues), o [escriba a James McKinney](mailto:jmckinney@open-contracting.org), Head of Technology de OCP.

source: Replace incorrect award statuses
es: Reemplace valores incorrectos del estado de la adjudicación

source: In rare cases, it is appropriate to change an award's status according to its contracts' statuses.
es: En raras ocasiones, conviene cambiar el estatus de una adjudicación en función del estatus de sus contratos.

source: The Government of Ruritania bundles many decisions into one award object, and uses the contract object as a proxy for the individual decision. As such, every award object is related to one or more contract objects. If the individual decision is cancelled (for example, the award is appealed at court or the supplier refuses to sign the contract), the contract object's status is changed to cancelled. The award object's status remains active.
es: El Gobierno de Ruritania agrupa muchas decisiones en un objeto de adjudicación y utiliza el objeto de contrato como sustituto de la decisión individual. Así, cada objeto de adjudicación está relacionado con uno o varios objetos de contrato. Si se anula la decisión individual (por ejemplo, la adjudicación se recurre ante un tribunal o el proveedor se niega a firmar el contrato), el estado del objeto de contrato cambia a anulado. El estado del objeto de adjudicación permanece activo.

source: Indicators assume that awards, not contracts, represent individual decisions – in conformance with OCDS. In the example, to better satisfy this assumption, the status of an award can be changed to cancelled if the status of every related contract is cancelled.
es: Los indicadores asumen que las adjudicaciones, y no los contratos, representan decisiones individuales, de conformidad con OCDS. En el ejemplo, para cumplir mejor este supuesto, el estado de una adjudicación puede cambiarse a cancelado si el estado de cada contrato relacionado es cancelado.

source: To replace an award's status in this way, add a `[corrections]` section with a `award_status_by_contract_status` property to your {doc}`../topics/settings`. Its value is a boolean. For example:
es: Para sustituir el estado de una adjudicación de este modo, añada una sección `[corrections]` con una propiedad `award_status_by_contract_status` a su {doc}`../topics/settings`. Su valor es un booleano. Por ejemplo:

source: Need to correct other values? [Create an issue on GitHub](https://github.com/open-contracting/cardinal-rs/issues), or [email James McKinney](mailto:jmckinney@open-contracting.org), OCP's Head of Technology.
es: ¿Necesita corregir otros valores? [Cree un issue en GitHub](https://github.com/open-contracting/cardinal-rs/issues), o [escriba a James McKinney](mailto:jmckinney@open-contracting.org), Head of Technology de OCP.
