Repository: open-contracting/cardinal-rs
Catalog: docs/locale/*/LC_MESSAGES/cli/indicators/R/024.po
Languages: es

source: Price close to winning bid (R024)
es: Precio cercano a la oferta ganadora (R024)

source: The percentage difference between the winning bid and the second-lowest valid bid is a low outlier.
es: La diferencia porcentual entre la oferta ganadora y la segunda oferta válida más baja es un valor atípico bajo

source: Methodology
es: Metodología

source: For each contracting process, the **difference** is calculated as $(secondLowestValidBidAmount - winningBidAmount) \over winningBidAmount$.
es: Para cada proceso de contratación, la **diferencia** es calculada como $(segundoMenorValorDeOfertaVálido- ValorOfertaGanadora) \over ValorOfertaGanadora$.

source: A contracting process is flagged if the difference is less than or equal to the **lower fence** of $Q_1 - 1.5(IQR)$, where $Q_1$ is the first quartile and $IQR$ is the interquartile range for the set of differences.
es: Se marca un proceso de contratación si la diferencia es menor o igual al **límite inferior** de $Q_1 - 1.5(IQR)$, donde $Q_1$ es el primer cuartil y $IQR$ es el rango intercuartílico del conjunto de diferencias

source: The winner and second-lowest bidder are also flagged.
es: El ganador y el oferente de la segunda oferta más baja son señalados.

source: Example
es: Ejemplo

source: In 25% ($Q_1$) of contracting processes in Atlantis, the second-lowest valid bid is at most 5% greater than the winning bid. In 75% ($Q_3$) of contracting processes, it is at most 7% greater. This yields a lower fence of 2% (`0.02`).
es: En el 25% ($Q_1$) de los procesos de contratación en Atlantis, la segunda oferta válida más baja es como máximo un 5% mayor que la oferta ganadora. En el 75% ($Q_3$) de los procesos de contratación es como máximo un 7% mayor. Esto produce un límite inferior del 2% (`0,02`).

source: In a contracting process, CollusionCorp won with a bid of \$100,000, and ProcureManipulate lost with the second-lowest bid of \$101,000. The difference is 1% (`0.01`). This is less than the lower fence of 2%. Therefore, the process is flagged.
es: En un proceso de contratación, CollusionCorp ganó con una oferta \$100,000 y ProcureManipulate perdió con la segunda oferta más baja de \$101,000. La diferencia es del 1% (`0,01`). Esto es menos que el límite inferior del 2%. Por lo tanto, el proceso es marcado.

source: Why is this a red flag?
es: ¿Por qué esto es una bandera roja?

source: A colluding bidder can mimic competition by submitting a bid that is similar in price (but different in quality, for example) from its colluding partner.
es: Un oferente colusorio puede imitar la competencia presentando una oferta de precio similar (pero diferente en calidad, por ejemplo) a la de su socio colusorio.

source: <small>Based on "Difference between first and second relative offer prices" in [*Toolkit for detecting collusive bidding in public procurement*](https://www.govtransparency.eu/wp-content/uploads/2015/11/GTI_WP2014_2_Toth_et_al_150413.pdf) and "Winning tender just below the next lowest bid" in [*Fraud in Public Procurement: A collection of Red Flags and Best Practices*](https://ec.europa.eu/sfc/system/files/documents/sfc-files/fraud-public-procurement-final-20122017-ares20176254403.pdf).</small>
es: <small>Basado en "Difference between first and second relative offer prices" en [*Toolkit for detecting collusive bidding in public procurement*](https://www.govtransparency.eu/wp-content/uploads/2015/11/GTI_WP2014_2_Toth_et_al_150413.pdf) y "Winning tender just below the next lowest bid" en [*Fraud in Public Procurement: A collection of Red Flags and Best Practices*](https://ec.europa.eu/sfc/system/files/documents/sfc-files/fraud-public-procurement-final-20122017-ares20176254403.pdf).</small>

source: Output
es: Salida

source: The indicator's value for the contracting process is the **difference**, as a decimal.
es: El valor del indicador para el proceso de contratación es la **diferencia**, en formato decimal.

source: The indicator's value for the tenderer is always 0.0.
es: El valor del indicador para un oferente es siempre 0.0.

source: If the ``--map`` command-line flag is set, the ``Maps`` key contains:
es: Si el comando ``--map`` está configurado, la clave ``Maps`` contiene:

source: The flagged tenderers for each flagged `ocid`.
es: Los oferentes señalados por cada `ocid` señalado.

source: Configuration
es: Configuración

source: All configuration is optional. To override the default **lower fence**, add to your settings file, as a decimal:
es: Toda configuración es opcional. Para modificar el **límite inferior** predeterminado, añádalo a su archivo de configuración, como decimal:

source: `fixed_price_procurement_methods` in {ref}`global-configuration`
es: `fixed_price_procurement_methods` en {ref}`global-configuration`

source: Exclusions
es: Exclusiones

source: A contracting process is excluded if:
es: Se excluye un proceso de contratación si:

source: An award's status is pending or invalid.
es: El estado de la adjudicación está pendiente o inválido.

source: The winning bid is not the lowest bid. (This indicator requires the award criteria to be price-only.)
es: La oferta ganadora no es la de menor precio. (Este indicador requiere que el criterio de adjudicación sea únicamente precio).

source: There are multiple active awards (a.k.a. winning bids). [#14](https://github.com/open-contracting/cardinal-rs/issues/14)
es: Hay múltiples adjudicaciones activas (a.k.a. ofertas ganadoras). [#14](https://github.com/open-contracting/cardinal-rs/issues/14)

source: A bid is submitted by multiple tenderers. [#17](https://github.com/open-contracting/cardinal-rs/issues/17)
es: Una oferta es presentada por múltiples oferentes. [#17](https://github.com/open-contracting/cardinal-rs/issues/17)

source: An award is made to multiple suppliers. [#17](https://github.com/open-contracting/cardinal-rs/issues/17)
es: Se otorga una adjudicación a múltiples proveedores. [#17](https://github.com/open-contracting/cardinal-rs/issues/17)

source: Do you want to eliminate an exclusion? Please contributed to the linked GitHub issue.
es: ¿Quieres eliminar una exclusión? Contribuya al issue vinculado de GitHub.

source: Assumptions
es: Supuestos

source: This indicator assumes that the tenderer of the winning bid didn't submit another valid bid.
es: Este indicador supone que el oferente de la oferta ganadora no presentó otra oferta válida.

source: Demonstration
es: Demostración

source: *Input*
es: *Entrada*

source: *Output*
es: *Salida*
