Repository: open-contracting/cardinal-rs
Catalog: docs/locale/*/LC_MESSAGES/cli/indicators/R/030.po
Languages: es

source: Late bid won (R030)
es: Oferta tardía gana (R030)

source: The winning bid was received after the submission deadline.
es: La oferta ganadora se recibió después de la fecha límite de presentación.

source: Methodology
es: Metodología

source: A contracting process is flagged if:
es: Un proceso de contratación es señalado si:

source: A valid bid's received date is after the submission deadline.
es: La oferta ganadora fue recibida después de la fecha límite de presentación.

source: At least one tenderer of the valid bid is the supplier of an active award.
es: Al menos un oferente con una oferta válida es el proveedor de una adjudicación activa.

source: These tenderers are also flagged.
es: Estos oferentes también son señalados.

source: Example
es: Ejemplo

source: The submission deadline is March 15. The Public Works Department leaks information from the received bids to CorruptX Solutions, to give it a competitive advantage. CorruptX Solutions submits a bid on April 1. The Public Works Department accepts the bid and awards the contract to CorruptX Solutions.
es: La fecha límite de presentación es el 15 de marzo. El Departamento de Obras Públicas filtra información de las ofertas recibidas a CorruptX Solutions, para darle una ventaja competitiva. CorruptX Solutions presenta una oferta el 1 de abril. El Departamento de Obras Públicas acepta la oferta y adjudica el contrato a CorruptX Solutions.

source: Why is this a red flag?
es: ¿Por qué esto es una bandera roja?

source: A corrupt buyer can award the pre-determined bidder by disregarding the submission deadline.
es: Un comprador corrupto puede adjudicar al oferente predeterminado ignorando las fechas límite de presentación de ofertas.

source: <small>Based on "Bids after the deadline accepted" in [*Corruption in Public Procurement: Finding the Right Indicators*](https://www.researchgate.net/publication/303359108_Corruption_in_Public_Procurement_Finding_the_Right_Indicators) and "Late submissions accepted" in [*Fraud in Public Procurement: A collection of Red Flags and Best Practices*](https://ec.europa.eu/sfc/system/files/documents/sfc-files/fraud-public-procurement-final-20122017-ares20176254403.pdf).</small>
es: <small>Basado en "Bids after the deadline accepted" en [*Corruption in Public Procurement: Finding the Right Indicators*](https://www.researchgate.net/publication/303359108_Corruption_in_Public_Procurement_Finding_the_Right_Indicators) y "Late submissions accepted" en [*Fraud in Public Procurement: A collection of Red Flags and Best Practices*](https://ec.europa.eu/sfc/system/files/documents/sfc-files/fraud-public-procurement-final-20122017-ares20176254403.pdf).</small>

source: Output
es: Salida

source: The indicator's value is always 1.0.
es: El valor del indicador es siempre 1.0.

source: If the ``--map`` command-line flag is set, the ``Maps`` key contains:
es: Si el comando ``--map`` está configurado, la clave ``Maps`` contiene:

source: The flagged tenderers for each flagged `ocid`.
es: Los oferentes señalados por cada `ocid` señalado.

source: Configuration
es: Configuración

source: The indicator is not configurable.
es: El indicador no es configurable.

source: Assumptions
es: Supuestos

source: This indicator assumes that the tenderer didn't submit another valid bid before the submission deadline; in other words, its late bid is the winning bid.
es: Este indicador supone que el oferente no presentó otra oferta válida antes de la fecha límite de presentación; en otras palabras, su oferta tardía es la oferta ganadora.

source: Is this assumption not true for your data? Does your data set the `/awards[]/relatedBid` field? Please [create an issue on GitHub](https://github.com/open-contracting/cardinal-rs/issues).
es: ¿El supuesto no es válido para su conjunto de datos? ¿El dataset contiene el campo `/awards[]/relatedBid` ? Por favor [crea an issue en GitHub](https://github.com/open-contracting/cardinal-rs/issues).

source: Demonstration
es: Demostración

source: *Input*
es: *Entrada*

source: *Output*
es: *Salida*
