Repository: open-contracting/cardinal-rs
Catalog: docs/locale/*/LC_MESSAGES/cli/indicators/R/038.po
Languages: es

source: Excessive disqualified bids (R038)
es: Alto número de ofertas descalificadas (R038)

source: The ratio of disqualified bids to submitted bids is a high outlier per buyer, procuring entity or tenderer.
es: La relación de ofertas descalificadas y las presentadas es un valor atípico alto para un comprador o un oferente.

source: Methodology
es: Metodología

source: For each buyer, the **ratio** is calculated as $numberOfBidsDisqualifiedByBuyer \over numberOfBidsSubmittedToBuyer$ across all contracting processes. A buyer is flagged if its ratio is greater than or equal to the **upper fence** of $Q_3 + 1.5(IQR)$, where $Q_3$ is the third quartile and $IQR$ is the interquartile range for the set of ratios.
es: Para cada comprador, la **proporción** se calcula como $númeroOfertasDescalificadasPorComprador \over númeroOfertasPresentadasAlComprador$ en todos los procesos de contratación. Se señala a un comprador si su proporción es mayor o igual al **límite superior** de $Q_3 + 1.5(IQR)$, donde $Q_3$ es el tercer cuartil y $IQR$ es el rango intercuartílico para el conjunto de proporciones.

source: For each procuring entity, the **ratio** is calculated the same as for buyers.
es: Para cada entidad compradora, la **proporción** se calcula de la misma forma que para los compradores.

source: For each tenderer, the **ratio** is calculated as $numberOfBidsDisqualifiedForTenderer \over numberOfBidsSubmittedByTenderer$ across all contracting processes. A tenderer is flagged if its ratio is greater than or equal to the **upper fence** of $Q_3 + 1.5(IQR)$, where $Q_3$ is the third quartile and $IQR$ is the interquartile range for the set of ratios.
es: Para cada oferente, la **proporción** se calcula como $númeroOfertasDescalificadasDelOferente \over númeroOfertasPresentadasPorOferente$ en todos los procesos de contratación. Se señala a un oferente si su proporción es mayor o igual al **límite superior** de $Q_3 + 1.5(IQR)$, donde $Q_3$ es el tercer cuartil y $IQR$ es el rango intercuartílico para el conjunto de proporciones.

source: Example for a buyer or procuring entity
es: Ejemplo para un comprador o una entidad compradora

source: 25% ($Q_1$) of buyers in Atlantis disqualify at most 2% of bids received. 75% ($Q_3$) of buyers disqualify at most 22% of bids received. This yields an upper fence of 52%.
es: 25% ($Q_1$) de los compradores en Atlantis descalifica a lo sumo 2% de las ofertas recibidas. 75% ($Q_3$) de los compradores descalifica a lo sumo 22% de las ofertas recibidas. Esto da un límite superior de 52%.

source: The State Water Corporation disqualified 59% of bids received. This is more than the upper fence of 52%. Therefore, the State Water Corporation is flagged.
es: La State Water Corporation descalificó el 59% de las ofertas recibidas. Esto es más que el límite superior del 52%. Por lo que se señala a State Water Corporation.

source: Example for a tenderer
es: Ejemplo para un oferente

source: 25% ($Q_1$) of bidders in Atlantis have no disqualified bids. 75% ($Q_3$) of bidders have at most 24% disqualified bids. This yields an upper fence of 60%.
es: 25% ($Q_1$) de los oferentes en Atlantis no tiene ofertas descalificadas. 75% ($Q_3$) de los oferentes tiene a lo sumo 24% de las ofertas descalificadas. Esto da un límite superior de 60%.

source: 73% of the bids submitted by MisconductCorp were disqualified. This is higher than the upper fence of 60%. Therefore, MisconductCorp is flagged.
es: El 73% de las ofertas presentadas por MisconductCorp fueron descalificadas. Esto es más alto que el límite superior del 60%. Por lo tanto, MisconductCorp es señalado.

source: Why is this a red flag?
es: ¿Por qué esto es una bandera roja?

source: A corrupt buyer or procuring entity can award pre-determined bidders by disqualifying other bidders' bids.
es: Un comprador corrupto puede adjudicar al oferente predeterminado descalificando las ofertas de otros oferentes.

source: A colluding bidder can mimic competition by submitting deliberately unqualified bids.
es: Un oferente colusorio puede imitar la competencia presentando ofertas deliberadamente no calificadas.

source: <small>Based on "Excluding Qualified Bidders" in [*Guide to Combating Corruption & Fraud in Infrastructure Development Projects*](https://guide.iacrc.org/potential-scheme-excluding-qualified-bidders/) and [*Behind the Scenes of ProZorro: Does Ukrainian business trust public procurement?*](https://ti-ukraine.org/wp-content/uploads/2019/11/Behind-the-Scenes-of-ProZorro.-Does-Ukrainian-business-trust-public-procurement.pdf).</small>
es: <small>Basado en "Excluding Qualified Bidders" en [*Guide to Combating Corruption & Fraud in Infrastructure Development Projects*](https://guide.iacrc.org/potential-scheme-excluding-qualified-bidders/) y [*Behind the Scenes of ProZorro: Does Ukrainian business trust public procurement?*](https://ti-ukraine.org/wp-content/uploads/2019/11/Behind-the-Scenes-of-ProZorro.-Does-Ukrainian-business-trust-public-procurement.pdf).</small>

source: Output
es: Salida

source: The indicator's value is the **ratio**, as a decimal.
es: El valor del indicador es una **razón**, como un decimal.

source: If the ``--map`` command-line flag is set, the ``Maps`` key contains:
es: Si el comando ``--map`` está configurado, la clave ``Maps`` contiene:

source: The buyer for each `ocid` in which at least one bid is disqualified.
es: El comprador por cada `ocid` en la que al menos una oferta es descalificada.

source: The procuring entity for each `ocid` in which at least one bid is disqualified.
es: La entidad compradora por cada `ocid` en la que al menos una oferta es descalificada.

source: Configuration
es: Configuración

source: All configuration is optional.
es: Toda configuración es opcional.

source: To override the default **upper fence**, add to your settings file, as a decimal:
es: Para modificar el **límite superior** predeterminado, añádalo a su archivo de configuración, como decimal:

source: Tenderers with fewer than 2 submitted bids are excluded. If you observe many false positives among tenderers with few submitted bids, you can increase this minimum. To override this minimum number, add to your settings file, as an integer:
es: Se excluyen los oferentes con menos de 2 ofertas presentadas. Si observa muchos falsos positivos entre oferentes con pocas ofertas presentadas, puede aumentar este mínimo. Para modificar este número mínimo, modifíquelo en su archivo de configuración, como un número entero:

source: Buyers and procuring entities with fewer than 2 contracting processes are excluded. If you observe many false positives among organizations with few contracting processes, you can increase this minimum. To override this minimum number, add to your settings file, as an integer:
es: Se excluyen los compradores y entidades compradoras con menos de 2 ofertas presentadas. Si observa muchos falsos positivos entre compradores con pocos procesos de contratación, puede aumentar este mínimo. Para modificar este número mínimo, modifíquelo en su archivo de configuración, como un número entero:

source: Put all properties under one `[R038]` section.
es: Coloque todas las propiedades en una sección `[R038]`.

source: Assumptions
es: Supuestos

source: This indicator assumes that `/buyer/id`, `/tender/procuringEntity/id` and `/bids/details[]/tenderers[]/id` are stable across contracting processes.
es: El indicador asume que `/buyer/id`, `/tender/procuringEntity/id` y `/bids/details[]/tenderers[]/id` son estables en todos los procesos de contratación.

source: Is this assumption not true for your data? Please contribute to GitHub issue [#32](https://github.com/open-contracting/cardinal-rs/issues/32).
es: ¿El supuesto no es válido para su conjunto de datos? Por favor contribuya al GitHub issue [#32](https://github.com/open-contracting/cardinal-rs/issues/32).

source: Demonstration
es: Demostración

source: *Input*
es: *Entrada*

source: *Output*
es: *Salida*
