Repository: open-contracting/cardinal-rs
Catalog: docs/locale/*/LC_MESSAGES/cli/indicators/R/048.po
Languages: es

source: Heterogeneous supplier (R048)
es: Proveedor multipropósito (R048)

source: The variety of items supplied by a tenderer is a high outlier.
es: La variedad de artículos suministrados por un oferente es un valor atípico alto.

source: Methodology
es: Metodología

source: This indicator requires awarded items to be classified using a hierarchy of numeric codes. For example, [UNSPSC](https://www.unspsc.org) and [CPV](https://simap.ted.europa.eu/cpv) have four primary levels.
es: Este indicador requiere que los artículos adjudicados se clasifiquen utilizando una jerarquía de códigos numéricos. Por ejemplo, [UNSPSC](https://www.unspsc.org) y [CPV](https://simap.ted.europa.eu/cpv) tienen cuatro niveles primarios.

source: For each tenderer, the **variety** is calculated as the number of distinct first-level classifications across all items awarded to the tenderer, across all contracting processes. A tenderer is flagged if its variety is greater than or equal to the **upper fence** of $Q_3 + 1.5(IQR)$, where $Q_3$ is the third quartile and $IQR$ is the interquartile range for the set of varieties among tenderers awarded in at least 20 contracting processes.
es: Para cada oferente, la **variedad** se calcula como el número de clasificaciones de primer nivel distintas en todos los artículos adjudicados al oferente, en todos los procesos de contratación. Un oferente es señalado si su variedad es mayor o igual que el **límite superior** de $Q_3 + 1,5(IQR)$, donde $Q_3$ es el tercer cuartil e $IQR$ es el rango intercuartílico para el conjunto de variedades entre oferentes adjudicados en al menos 20 procesos de contratación.

source: Example
es: Ejemplo

source: 25% ($Q_1$) of bidders in Atlantis supply items in 1 product category. 75% ($Q_3$) of bidders supply items in at most 4 product categories. This yields an upper fence of 8.5 (9 in effect).
es: El 25% ($Q_1$) de los oferentes de Atlantis suministran artículos en 1 categoría de producto. El 75% ($Q_3$) de los oferentes suministran artículos en un máximo de 4 categorías de productos. El resultado es un límite superior de 8,5 (9 en la práctica).

source: RentSeekers Inc. supplies items in 20 product categories. This is higher than the upper fence of 8.5. Therefore, RentSeekers Inc. is flagged.
es: RentSeekers Inc. suministra artículos en 20 categorías de productos. Esta cifra es superior al límite superior de 8,5. Por lo tanto, RentSeekers Inc. es señalada.

source: Why is this a red flag?
es: ¿Por qué esto es una bandera roja?

source: A heterogeneous supplier is more likely to be unsuitable, increasing the risk of low value for money, low quality of delivery, and/or rent extraction.
es: Un proveedor heterogéneo tiene más probabilidades de ser no óptimo, lo que aumenta el riesgo de que la relación calidad-precio sea baja, la calidad de la prestación del bien o servicio sea baja y/o se extraigan rentas.

source: <small>Based on "Component C1B" in [*Design and measurement of a corruption risk index from a supplier perspective in the context of COVID-19 emergency*](https://www.estudiosanticorrupcion.org/wp-content/uploads/2021/02/IA-OCP-Working-PaperV3.pdf).</small>
es: <small>Basado en "Component C1B" en [*Design and measurement of a corruption risk index from a supplier perspective in the context of COVID-19 emergency*](https://www.estudiosanticorrupcion.org/wp-content/uploads/2021/02/IA-OCP-Working-PaperV3.pdf).</small>

source: Output
es: Salida

source: The indicator's value is the **variety**, as a decimal.
es: El valor del indicador es la **variedad**, como un decimal.

source: Configuration
es: Configuración

source: All configuration is optional.
es: Toda configuración es opcional.

source: To override the default **upper fence**, add to your settings file, as a natural number:
es: Para modificar el **límite superior** predeterminado, añádalo a su archivo de configuración, como un número natural:

source: If the first level of the classification hierarchy isn't coded as two digits, or if the first level is too broad, you can increase the number of digits. To override the default number of **digits**, add to your settings file, as a natural number:
es: Si el primer nivel de la jerarquía de clasificación no está codificado con dos dígitos, o si el primer nivel es demasiado amplio, puede aumentar el número de dígitos. Para modificar el número predeterminado de **dígitos**, añádalo a su archivo de configuración, como un número natural:

source: If a tenderer is awarded in a small number of contracting processes, its variety is expected to be small. To minimize this correlation, the calculation of the upper fence considers only tenderers awarded in at least 20 contracting processes. To override this minimum number, add to your settings file, as a natural number:
es: Si un oferente resulta adjudicado en un número reducido de procesos de contratación, se espera que su variedad sea pequeña. Para minimizar esta correlación, el cálculo del límite superior sólo considera oferentes adjudicados en al menos 20 procesos de contratación. Para modificar este número mínimo, añádalo a su archivo de configuración, como un número natural:

source: Exclusions
es: Exclusiones

source: An active award is excluded if it is made to multiple suppliers.
es: Una adjudicación activa se excluye si se adjudica a múltiples proveedores.

source: Demonstration
es: Demostración

source: *Input*
es: *Entrada*

source: *Output*
es: *Salida*
