Repository: open-contracting/cardinal-rs
Catalog: docs/locale/*/LC_MESSAGES/contributing/indicators.po
Languages: es

source: In `docs/cli/init.md`, edit the command's output at the bottom of the file to match the multiline string.
es: En `docs/cli/init.md`, edite la salida del comando en la parte inferior del archivo para que coincida con la cadena multilínea.

source: 7. Write the tests
es: 7. Escriba las pruebas.

source: The test framework reads `*.jsonl` files in the `tests/fixtures/indicators/` directory. Each `*.jsonl` file is prefixed with an indicator code: for example, `R038.jsonl` and `R038_tenderer.jsonl`. The test framework runs the `indicators` command with that indicator {ref}`enabled<enable-an-indicator>`, and compares the output to the corresponding `*.expected` file: for example, `R038.expected` and `R038_tenderer.expected`.
es: El marco de prueba lee archivos `*.jsonl` en el directorio `tests/fixtures/indicators/`. Cada archivo `*.jsonl` tiene como prefijo un código indicador: por ejemplo, `R038.jsonl` y `R038_tenderer.jsonl`. El marco de prueba ejecuta el comando `indicators` con ese indicador {ref}`habilitado<enable-an-indicator>` y compara la salida con el archivo `*.expected` correspondiente: por ejemplo , `R038.expected` y `R038_tenderer.expected`.

source: The test file(s) for an indicator should:
es: El(los) archivo(s) de prueba de un indicador deben:

source: Cause the indicator to return a result (to test for true positives)
es: Ocasiona que el indicador devuelva un resultado (para probar verdaderos positivos)

source: Include data that covers any {ref}`exclusions<indicators-exclusions>` or edge cases (to test against false positives)
es: Incluya datos que cubran cualquier {ref}`exclusiones<indicators-exclusions>` o casos extremos (para realizar pruebas contra falsos positivos).

source: Not include data that is irrelevant to the indicator (to make the test readable)
es: No incluir datos que sean irrelevantes para el indicador (para que la prueba sea legible)

source: You can use the `ocid` field to describe each compiled release.
es: Puede utilizar el campo `ocid` para describir cada versión compilada.

source: You can use single letters for identifiers, for example:
es: Puede utilizar letras individuales para los identificadores, por ejemplo:

source: Identifier to be **F**lagged
es: Identificador que se va a señalar

source: **B**uyer
es: Comprador

source: **P**rocuring entity
es: Entidad contratante

source: **S**upplier of an active award
es: Proveedor de una adjudicación activa

source: Supplier of a **C**ancelled award
es: Proveedor de una adjudicación cancelada

source: Supplier of an **U**nsuccessful award
es: Proveedor de una adjudicación no exitosa

source: Tenderer of a **I**nvited bid
es: Oferente de una oferta invitada

source: Tenderer of a **P**ending bid
es: Oferente de una oferta pendiente

source: Tenderer of a **V**alid bid
es: Oferente de una oferta válida

source: Tenderer of a **D**isqualified bid
es: Oferente de una oferta descalificada

source: **W**inning tenderer
es: Oferente ganador

source: **L**osing tenderer
es: Oferente perdedor

source: Edit the `R999.jsonl` and `R999.expected` files in the `tests/fixtures/indicators/` directory from {ref}`indicators-boilerplate`. To only test whether the indicator returns a result, replace the contents of the files with:
es: Edite los archivos `R999.jsonl` y `R999.expected` en el directorio `tests/fixtures/indicators/` de {ref}`indicators-boilerplate`. Para probar únicamente si el indicador devuelve un resultado, reemplace el contenido de los archivos con:

source: And:
es: Y:

source: All tests should pass, including:
es: Todas las pruebas deben pasar, incluyendo:

source: 8. Add documentation
es: 8. Agregar documentación

source: Document the indicator
es: Documentar el indicador

source: Open the documentation page (`docs/cli/indicators/R/999.md`, in this example) in a text editor.
es: Abra la página de documentación (`docs/cli/indicators/R/999.md`, en este ejemplo) en un editor de texto.

source: Title
es: Título

source: Write a concise, one-line sentence communicating the condition under which the red flag is raised. Read {ref}`other titles<list>` to match the word choice.
es: Escriba una oración concisa de una línea que comunique la condición bajo la cual se levanta la bandera roja. Lea {ref}`otros títulos<list>` para que coincida con la palabra elegida.

source: Methodology
es: Metodología

source: Read {ref}`other methodologies<list>`, to match the word choice, sentence construction, and use of bullet lists and paragraph breaks.
es: Lea {ref}`otras metodologías<list>`, para hacer coincidir la elección de palabras, la construcción de oraciones y el uso de listas de viñetas y saltos de párrafo.

source: Bold the first occurrence of each word in the methodology that can be configured (*Configuration*) or interpreted (*Output*).
es: Resalte en negrita la primera aparición de cada palabra en la metodología que se puede configurar (*Configuration*) o interpretar (*Output*).

source: Write a brief example containing names and numbers, to ease the interpretation of the methodology.
es: Escriba un breve ejemplo que contenga nombres y números, para facilitar la interpretación de la metodología.

source: Explain why the methodology indicates a red flag.
es: Explique por qué la metodología indica una bandera roja.

source: Output
es: Salida

source: Bold the word for the concept from the methodology to which the output corresponds. Declare the type of the output if it is ambiguous.
es: Resalte en negrita la palabra para el concepto de la metodología a la que corresponde el resultado. Declare el tipo de salida si es ambiguo.

source: Configuration
es: Configuración

source: Read {ref}`other configurations<list>`, to match the phrasing and styling. Bold the words for the concepts from the methodology that are configurable. Declare the type of the configuration.
es: Lea {ref}`otras configuraciones<list>`, para que coincida con la redacción y el estilo. En negrita las palabras de los conceptos de la metodología que son configurables. Declare el tipo de configuración.

source: If there is no configuration, delete this section.
es: Si no hay configuración, elimine esta sección.

source: Exclusions
es: Exclusiones

source: Describe any features that cause the indicator to skip a compiled release, as a bullet list.
es: Describa cualquier característica que haga que el indicador se salte una versión compilada, como una lista con viñetas.

source: If there are no exclusions, delete this section.
es: Si no hay exclusiones, elimine esta sección.

source: Assumptions
es: Supuestos

source: Mention any assumptions made by the methodology. (In general, there should be none.)
es: Mencione cualquier supuesto hecho por la metodología. (En general, no debería haber ninguno).

source: If there are no assumptions, delete this section.
es: Si no hay supuestos, elimine esta sección.

source: Demonstration
es: Demostración

source: Adapt your test files to update the `docs/examples/R/999.jsonl` file with a minimal input, and the `console` code block with the corresponding output. Run `cargo test` to check the output.
es: Adapte sus archivos de prueba para actualizar el archivo `docs/examples/R/999.jsonl` con una entrada mínima y el bloque de código `console` con la salida correspondiente. Ejecute la "prueba de carga" para verificar la salida.

source: Update the list of indicators and the changelog
es: Actualizar la lista de indicadores y el registro de cambios.

source: In `docs/cli/indicators/index.md`, add the indicator in alphabetical order to the relevant table:
es: En `docs/cli/indicators/index.md`, agregue el indicador en orden alfabético a la tabla correspondiente:

source: In `docs/changelog.md`, add a changelog entry for the indicator:
es: En `docs/changelog.md`, agregue una entrada de registro de cambios para el indicador:

source: **You're done!** 🎉 We welcome all new indicators as pull requests on [GitHub](https://github.com/open-contracting/cardinal-rs).
es: **¡Ya terminó!** 🎉 Todos los indicadores nuevos son bienvenidos como pull requests en [GitHub](https://github.com/open-contracting/cardinal-rs).
