Repository: open-contracting/cardinal-rs
Catalog: docs/locale/*/LC_MESSAGES/contributing/indicators.po
Languages: es

source: Add an indicator
es: Agregar un indicador

source: You can use the check marks to track your progress (do not reload the page).
es: Puede utilizar las marcas de verificación para realizar seguimiento de su progreso (no vuelva a cargar la página).

source: In this tutorial, the example indicator is given the code R999. Its methodology is "A competition completed with few submitted bids," with the default for "few" being 1 bid.
es: En este tutorial, el indicador de ejemplo recibe el código R999. Su metodología es "Una competencia completada con pocas ofertas presentadas", siendo el valor predeterminado para "pocas" 1 oferta.

source: 1. Develop the methodology
es: 1. Desarrollar la metodología

source: All fences are inclusive in Cardinal, to be consistent and to be easy to interpret. However, this means that, if the methodology identifies outliers using the interquartile range, and if the interquartile range is zero, then the indicator will always return a result. Therefore, the methodology must guard against this by returning nothing if the interquartile range is zero.
es: Todos los umbrales son inclusivos en Cardinal, para que sean consistentes y fáciles de interpretar. Sin embargo, esto significa que, si la metodología identifica valores atípicos utilizando el rango intercuartílico, y si este es cero, entonces el indicador siempre arrojará un resultado. Por lo tanto, la metodología debe evitar esto al no devolver nada si el rango intercuartílico es cero.

source: 2. Assign a code
es: 2. Asigna un código

source: When adding an indicator that is not assigned a code among the [resources](https://www.open-contracting.org/resources/) of the Open Contracting Partnership (or if you don't know):
es: Al agregar un indicador al que no se le asigna un código entre los [recursos](https://www.open-contracting.org/resources/) de Open Contracting Partnership (o si no lo sabe):

source: [Create an issue on GitHub](https://github.com/open-contracting/cardinal-rs/issues) to be assigned a code.
es: [Cree un issue en GitHub](https://github.com/open-contracting/cardinal-rs/issues) para que se le asigne un código.

source: 3. Add boilerplate content
es: 3. Agregue contenido repetitivo

source: One-time setup
es: Configuración de una sola vez

source: To install the requirements for automation, create a Python virtual environment and run:
es: Para instalar los requisitos de automatización, cree un entorno virtual Python y ejecute:

source: To perform these steps, run, replacing `r999`:
es: Para realizar estos pasos, ejecute, reemplazando `r999`:

source: The files created are explained in the next sections.
es: Los archivos creados se explican en las secciones siguientes.

source: Create the new module, `src/indicators/r999.rs`:
es: Cree el nuevo módulo, `src/indicators/r999.rs`:

source: Create the test input, `tests/fixtures/indicators/R999.jsonl`:
es: Cree la entrada de prueba, `tests/fixtures/indicators/R999.jsonl`:

source: Create the test output, `tests/fixtures/indicators/R999.expected`:
es: Cree la salida de la prueba, `tests/fixtures/indicators/R999.expected`:

source: Create the documentation page, `docs/cli/indicators/R/999.md`:
es: Cree la página de documentación, `docs/cli/indicators/R/999.md`:

source: Create the demonstration input, `docs/examples/R/999.jsonl`:
es: Cree la entrada de demostración, `docs/examples/R/999.jsonl`:

source: In `src/indicators/mod.rs`:
es: En `src/indicadores/mod.rs`:

source: Declare the new module in alphabetical order at the top of the file:
es: Declare el nuevo módulo en orden alfabético en la parte superior del archivo:

source: Add a field to the `Settings` struct. This field is explained in the next section.
es: Agregue un campo a la estructura `Settings` . Este campo se explica en la siguiente sección.

source: Add a variant to the `Indicator` enum. The variants are keys in the JSON output of the {doc}`../cli/indicators/index` command:
es: Agregue una variante a la enumeración `Indicator`. Las variantes son claves en la salida JSON del comando {doc}`../cli/indicators/index`:

source: In `src/lib.rs`:
es: En `src/lib.rs`:

source: Import the new struct from the new module in alphabetical order at the top of the file:
es: Importe la nueva estructura del nuevo módulo en orden alfabético en la parte superior del archivo:

source: Add the new struct in alphabetical order to the ``add_indicators!`` macro call:
es: Agregue la nueva estructura en orden alfabético a la llamada de macro ``add_indicators!``:

source: In `docs/examples/settings.ini`, add a section for the new indicator in alphabetical order:
es: En `docs/examples/settings.ini`, agregue una sección para el nuevo indicador en orden alfabético:

source: Try it!
es: ¡Inténtelo!

source: If you run:
es: Si corre:

source: All tests should pass! (with warnings about unused variables and imports)
es: ¡Todas las pruebas deberían pasar! (con advertencias sobre variables no utilizadas e importaciones)

source: 4. Edit the settings in `src/indicators/mod.rs`
es: 4. Edite la configuración en `src/indicators/mod.rs`

source: The {ref}`configurations<indicators-config>` for an indicator are represented as a field named after the indicator (`R999`) on the `Settings` struct, defined in `src/indicators/mod.rs`.
es: Las {ref}`configuraciones<indicators-config>` para un indicador se representan como un campo con el nombre del indicador (`R999`) en la estructura `Settings`, definida en `src/indicators/mod.rs`.

source: In Cardinal, all configurations are optional. So, the field must be an [`Option<T>`](https://doc.rust-lang.org/std/option/index.html), and the fields on the struct that the `Option` contains (`T`) must also be optional.
es: En Cardinal, todas las configuraciones son opcionales. Entonces, el campo debe ser una [`Option<T>`](https://doc.rust-lang.org/std/option/index.html), y los campos en la estructura que contiene la `Option` (`T`) también deben ser opcionales.

source: If the indicator's only configuration is a threshold (integer or decimal), then the `IntegerThreshold` or `FloatThreshold` struct can be used, shown below for easy reference.
es: Si la única configuración del indicador es un umbral (entero o decimal), entonces se puede utilizar la estructura `IntegerThreshold` o `FloatThreshold`, que se muestra a continuación para facilitar la referencia.

source: If the indicator has no configuration, the `Empty` struct can be used, which has no fields.
es: Si el indicador no tiene configuración, se puede utilizar la estructura `Empty`, que no tiene campos.

source: Otherwise, create a new struct named after the indicator. For example:
es: De lo contrario, cree una nueva estructura con el nombre del indicador. Por ejemplo:

source: The [`#[serde(deny_unknown_fields)]`](https://serde.rs/container-attrs.html#deny_unknown_fields) attribute causes an error if the user sets an unknown property.
es: El atributo [`#[serde(deny_unknown_fields)]`](https://serde.rs/container-attrs.html#deny_unknown_fields) provoca un error si el usuario establece una propiedad desconocida.

source: Example
es: Ejemplo

source: R999's methodology is "A competition completed with few submitted bids." You will edit the settings to allow users to configure the number of submitted bids (the "threshold") that raises the red flag.
es: La metodología de R999 es "Un concurso completado con pocas ofertas presentadas". Editará la configuración para permitir a los usuarios configurar la cantidad de ofertas enviadas (el "umbral") que genera la señal de alerta.

source: In `src/indicators/mod.rs`, the `Settings` struct already has a field for the indicator from {ref}`indicators-boilerplate`:
es: En `src/indicators/mod.rs`, la estructura `Settings` ya tiene un campo para el indicador de {ref}`indicators-boilerplate`:

source: As is, no configuration is allowed. Cardinal attempts to parse any properties in the `[R999]` section of the INI file into the `Empty` struct. Because the struct has no fields, no properties are parsed, and the user sees an error as feedback.
es: Tal como está, no se permite ninguna configuración. Cardinal intenta analizar cualquier propiedad en la sección `[R999]` del archivo INI en la estructura `Empty`. Debido a que la estructura no tiene campos, no se analizan propiedades y el usuario ve un error como retroalimentación.

source: The number of submitted bids can be represented as an integer. To parse a property with the name `threshold` and an integer value, you can reuse the `IntegerThreshold` struct:
es: El número de ofertas presentadas se puede representar como un número entero. Para analizar una propiedad con el nombre `threshold` y un valor entero, puede reutilizar la estructura `IntegerThreshold`:

source: Users can now configure R999's threshold, using the {doc}`../topics/settings`. For example:
es: Los usuarios ahora pueden configurar el umbral de R999, usando {doc}`../topics/settings`. Por ejemplo:

source: Follow the example, create a `settings.ini` file with the content above, and run:
es: Siga el ejemplo, cree un archivo `settings.ini` con el contenido anterior y ejecute:

source: The output should be `{}`, with no errors about unknown fields!
es: ¡La salida debe ser `{}`, sin errores sobre campos desconocidos!

source: 5. Write the module
es: (5) Escriba el módulo.

source: Open the new module (`src/indicators/r999.rs`, in this example) in a text editor.
es: Abra el nuevo módulo (`src/indicators/r999.rs`, en este ejemplo) en un editor de texto.

source: An indicator is an `impl`ementation of the `Calculate` trait on a struct (`R999`, in this example).
es: Un indicador es una "implementación del rasgo `Calculate` en una estructura ("R999", en este ejemplo).

source: Note that items (like structs) are scoped by their module. In other words, an `R999` struct in `mod.rs` for the indicator's configuration has no relation with the `R999` struct in `r999.rs` for its internal state.
es: Tenga en cuenta que los elementos (como las estructuras) tienen el alcance de su módulo. En otras palabras, una estructura `R999` en `mod.rs` para la configuración del indicador no tiene relación con la estructura `R999` en `r999.rs` para su estado interno.

source: Comparing Rust to other languages, [structs](https://doc.rust-lang.org/book/ch05-00-structs.html) are like objects, and [traits](https://doc.rust-lang.org/book/ch10-02-traits.html) are like interfaces. Structs have data ("fields"), and `impl` blocks provide a struct's methods. Like Python, items are scoped by module and are imported (`use`).
es: Comparando Rust con otros lenguajes, las [estructuras](https://doc.rust-lang.org/book/ch05-00-structs.html) son como objetos, y los [traits](https://doc.rust-lang.org/book/ch10-02-traits.html) son como interfaces. Las estructuras tienen datos ("campos") y los bloques `impl` proporcionan los métodos de una estructura. Al igual que Python, los elementos tienen un alcance por módulo y se importan (`use`).

source: The `Calculate` trait declares four methods, which are defined in the `impl` block:
es: El trait `Calculate` declara cuatro métodos, que se definen en el bloque `impl`:

source: Edit the `new` method
es: Editar el método `new`

source: If the indicator is not configurable, then the `new` method and the struct (`R999`) can be left as-is.
es: Si el indicador no es configurable, entonces el método `new` y la estructura (`R999`) se pueden dejar como están.

source: If the indicator is configurable, then the `new` method reads the `settings` arguments and returns an instance of the struct (the capitalized `Self` token refers to the struct).
es: Si el indicador es configurable, entonces el método `new` lee los argumentos `settings` y devuelve una instancia de la estructura (el token `Self` en mayúscula se refiere a la estructura).

source: To avoid unnecessary memory allocation, you can [`std::mem::take()`](https://doc.rust-lang.org/std/mem/fn.take.html) the `Settings` field named after the indicator. Indicators should not use other indicators' settings.
es: Para evitar una asignación de memoria innecesaria, puede [`std::mem::take()`](https://doc.rust-lang.org/std/mem/fn.take.html) el campo `Settings` denominado después del indicador. Los indicadores no deben utilizar la configuración de otros indicadores.

source: R999's methodology is "A competition completed with few submitted bids," with the default for "few" being 1 bid.
es: La metodología de R999 es "Una competencia completada con pocas ofertas presentadas", siendo el valor predeterminado para "pocas" 1 oferta.

source: So far, you added the `R999` field to the `Settings` struct in `src/indicators/mod.rs`.
es: Hasta ahora, agregó el campo `R999` a la estructura `Configuración` en `src/indicators/mod.rs`.

source: You can now move the field's value into the `R999` struct in the new module, `src/indicators/r999.rs`.
es: Ahora puede mover el valor del campo a la estructura `R999` en el nuevo módulo, `src/indicators/r999.rs`.

source: Add a corresponding field to the `R999` struct. All configurations are optional (in this case, `Option<usize>`), but the methodology is to set a default of 1. So, we can make the field non-optional on this struct:
es: Agregue un campo correspondiente a la estructura `R999`. Todas las configuraciones son opcionales (en este caso, `Option<usize>`), pero la metodología es establecer un valor predeterminado de 1. Por lo tanto, podemos hacer que el campo no sea opcional en este caso:

source: If the field's default value couldn't be set at initialization, you would make it optional: for example, if the default value depended on order statistics, like quartiles.
es: Si el valor predeterminado del campo no se puede establecer en la inicialización, lo haría opcional: por ejemplo, si el valor predeterminado dependiera de estadísticas de orden, como cuartiles.

source: Move the value from the `Settings` struct into the `R999` struct:
es: Mueva el valor de la estructura `Settings` a la estructura "R999":

source: This incantation requires understanding the [`Option`](https://doc.rust-lang.org/std/option/index.html) type, the [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) trait and the [`std::mem::take()`](https://doc.rust-lang.org/std/mem/fn.take.html) function. In short, the `R999` struct's `threshold` field is set to the configured value if set and the default value (1), otherwise.
es: Esta formula requiere comprender el tipo [`Option`](https://doc.rust-lang.org/std/option/index.html), el trait [`Default`](https://doc.rust-lang.org/std/default/trait.Default.html) y la función [`std::mem::take()`](https://doc.rust-lang.org/std/mem/fn.take.html). En resumen, el campo `threshold` de la estructura `R999` se establece en el valor configurado si está establecido y en el valor predeterminado (1) en caso contrario.

source: If the field's default value couldn't be set at initialization, you would omit the `unwrap_or(1)`:
es: Si el valor predeterminado del campo no se puede establecer en la inicialización, se omitirá `unwrap_or(1)`:

source: If you run the command again, the output should still be `{}`:
es: Si ejecuta el comando nuevamente, la salida aún debería ser `{}`:

source: How data is prepared
es: Cómo se preparan los datos

source: As described in the [overall workflow](../topics/workflow), data is prepared before it is processed. This avoids complicating the indicator calculations with many exceptions and edge cases.
es: Como se describe en [flujo de trabajo general](../topics/workflow), los datos se preparan antes de procesarlos. Esto evita complicar los cálculos de los indicadores con muchas excepciones y casos extremos.

source: Also, as described in the {ref}`prepare workflow<prepare-workflow>`, the `prepare` command should only warn about quality issues that it can fix and that interfere with the indicator calculations.
es: Además, como se describe en {ref}`este flujo de trabajo<prepare-workflow>`, el comando `prepare` solo debe advertir sobre problemas de calidad que puede solucionar y que interfieren con los cálculos de los indicadores.

source: With that in mind, while you implement the indicator, think about whether:
es: Teniendo esto en cuenta, mientras implementa el indicador, piense si:

source: An existing {ref}`configuration<prepare-config>` of the `prepare` command should be edited to include additional fields.
es: Una {ref}`configuración<prepare-config>` existente del comando `prepare` debe editarse para incluir campos adicionales.

source: For example, at the time of writing, the `currency` property of the {ref}`defaults<fill-in-missing-values>` section only applies to `/bids/details[]/value/currency`, because no indicator uses other currency fields yet.
es: Por ejemplo, en este momento la propiedad `moneda` de la sección {ref}`defaults<fill-in-missing-values>` solo se aplica a `/bids/details[]/value/currency`, porque ningún indicador utiliza otros campos de moneda todavía.

source: A new configuration should be added, to address a quality issue you encountered.
es: Se debe agregar una nueva configuración para solucionar un problema de calidad que encontró.

source: [Create an issue on GitHub](https://github.com/open-contracting/cardinal-rs/issues) to request any changes to the `prepare` command.
es: [Cree un issue en GitHub](https://github.com/open-contracting/cardinal-rs/issues) para solicitar cualquier cambio en el comando `prepare`.

source: How data is processed
es: Cómo se procesan los datos

source: Processing is divided into 3 steps: fold, reduce, and finalize. A trait method corresponds to each step.
es: El procesamiento se divide en 3 pasos: plegar (fold), reducir (reduce) y finalizar (finalize). Un método de rasgo corresponde a cada paso.

source: Each method accepts an `item` argument, whose type is `Indicators` (named after the command).
es: Cada método acepta un argumento `item`, cuyo tipo es `Indicators` (que lleva el nombre del comando).

source: The `Indicators` struct has a `results` field for the final results, and other fields – whose names are prefixed by indicator codes – for intermediate results:
es: La estructura `Indicators` tiene un campo `results` para los resultados finales y otros campos, cuyos nombres están precedidos por códigos de indicador, para resultados intermedios:

source: Cardinal processes compiled releases concurrently. The responsibilities of the 3 methods are:
es: Cardinal procesa las publicaciones compiladas al mismo tiempo. Las responsabilidades de los 3 métodos son:

source: Operate on a single compiled release (its `release` argument), and write either final results or intermediate results.
es: Opere en una única entrega compilada (su argumento `release`) y escriba resultados finales o resultados intermedios.

source: Combine the intermediate results from the *fold* step (if any) into one `Indicators` instance. The `other` argument represents the instance that is to be combined.
es: Combine los resultados intermedios del paso *fold* (si corresponde) en una instancia de `Indicators` . El argumento `other` representa la instancia que se va a combinar.

source: Use the intermediate results to write final results.
es: Utilice los resultados intermedios para escribir los resultados finales.

source: Use the `set_result!` macro to write final results. It accepts an `item`, {ref}`group<indicators-demo>` (`OCID`, `Tenderer`, `Buyer`, or `ProcuringEntity`), identifier, indicator code, and result as a decimal (`f64`). For example:
es: Utilice la macro `set_result!` para escribir los resultados finales. Acepta un `item`, {ref}`grupo<indicators-demo>` (`OCID`, `Tenderer`, `Buyer` o `ProcuringEntity`), identificador, código de indicador y resultado. como decimal (`f64`). Por ejemplo:

source: Or:
es: O:

source: If you remember, the indicator code was added as a variant to the `Indicator` enum in {ref}`indicators-boilerplate`.
es: Si recuerda, el código del indicador se agregó como una variante a la enumeración `Indicator` en {ref}`indicators-boilerplate`.

source: Implementing an indicator often raises questions about its methodology. In general, try to implement it such that its result is stable. In other words, new data can cause a red flag to be raised, but shouldn't cause it to be lowered. This typically means waiting for all relevant data to be available. For example, an indicator about the number of submitted bids should wait for all awards to be complete.
es: La implementación de un indicador a menudo plantea dudas sobre su metodología. En general, intente implementarlo de manera que su resultado sea estable. En otras palabras, los datos nuevos pueden hacer que se levante una señal de alerta, pero no deberían hacer que se reduzca. Normalmente, esto significa esperar a que todos los datos relevantes estén disponibles. Por ejemplo, un indicador sobre el número de ofertas presentadas debería esperar a que se completen todas las adjudicaciones.

source: `fold` method
es: método `fold`

source: Final results
es: Resultados finales

source: If the methodology considers compiled releases in isolation, the final results can be written by the `fold` method. In this case, the `reduce` and `finalize` methods can be deleted.
es: Si la metodología considera las versiones compiladas de forma aislada, los resultados finales se pueden escribir mediante el método `fold`. En este caso, los métodos `reduce` y `finalize` se pueden eliminar.

source: At this point, you need to know Rust, but you can study other indicators and adapt their code.
es: En este punto, necesita conocer Rust, pero puede estudiar otros indicadores y adaptar su código.

source: R999's methodology is "A competition completed with few submitted bids." Comments are provided to ease reading.
es: La metodología de R999 es "Un concurso completado con pocas ofertas presentadas". Se proporcionan comentarios para facilitar la lectura.

source: The compiled release should be flagged by the R999 indicator!
es: ¡La versión compilada debe estar marcada por el indicador R999!

source: Intermediate results
es: Resultados intermedios

source: If the methodology considers compiled releases in aggregate – for example, it uses order statistics to identify outliers – then the `fold` method writes intermediate results to new field(s) on the `Indicators` struct. For example:
es: Si la metodología considera las entregas compiladas en conjunto (por ejemplo, utiliza estadísticas de orden para identificar valores atípicos), entonces el método `fold` escribe resultados intermedios en nuevos campos en la estructura `Indicators`. Por ejemplo:

source: To do
es: Pendiente

source: If you need guidance on this step, [create an issue on GitHub](https://github.com/open-contracting/cardinal-rs/issues).
es: Si necesita orientación sobre este paso, [cree un issue en GitHub](https://github.com/open-contracting/cardinal-rs/issues).

source: `reduce` method
es: método `reduce`

source: If the indicator considers and flags a subset of tenderers, buyers, or procuring entities, set `item.maps`. See `r038.rs`, for example.
es: Si el indicador considera y señala un subconjunto de oferentes, compradores o entidades contratantes, establezca `item.maps`. Consulte `r038.rs`, por ejemplo.

source: `finalize` method
es: método `finalize`

source: 6. Update the `init` command
es: 6. Actualice el comando `init`

source: In `src/lib.rs`, edit the multiline string at the top of the `init` function to include a section for the new indicator, and any configurations as comments.
es: En `src/lib.rs`, edite la cadena multilínea en la parte superior de la función `init` para incluir una sección para el nuevo indicador y cualquier configuración como comentario.
