Repository: open-contracting/cardinal-rs
Catalog: docs/locale/*/LC_MESSAGES/changelog.po
Languages: es

source: Changelog
es: Registro de cambios

source: Added
es: Agregado

source: {doc}`cli/prepare` command:
es: comando {doc}`cli/prepare`:

source: Add `[redactions]` section. Warn about zero-value bids.
es: Agregar sección de `[redactions]`. Advertir sobre ofertas con valor cero.

source: Add `[corrections]` section.
es: Agregar la sección de `[corrections]`.

source: Add `[modifications]` section.
es: Agregar la sección de `[modifications]`.

source: {doc}`cli/indicators/index` command:
es: Comando {doc}`cli/indicators/index`:

source: [R028](cli/indicators/R/028): (*Identical bid prices*).
es: [R028](cli/indicators/R/028): (*Precios de oferta idénticos*).

source: [R030](cli/indicators/R/030): (*Late bid won*).
es: [R030](cli/indicators/R/030): (*Oferta tardía gana*).

source: [R048](cli/indicators/R/048): (*Heterogeneous supplier*).
es: [R048](cli/indicators/R/048): (*Proveedor multipropósito*).

source: [R058](cli/indicators/R/058): (*Heavily discounted bid*).
es: [R058](cli/indicators/R/058): (*Oferta con precio muy bajo*).

source: Add `no_price_comparison_procurement_methods` configuration.
es: Agregar configuración `no_price_comparison_procurement_methods`.

source: Add `price_comparison_procurement_methods` configuration.
es: Agregar configuración `price_comparison_procurement_methods`.

source: Add `[exclusions]` section.
es: Agregar sección de `[exclusions]`.

source: Changed
es: Cambios

source: Warn about invalid default statuses.
es: Alertar sobre estados predeterminados inválidos.

source: [R024](cli/indicators/R/024): Flag the winner and second-lowest bidder. Add `--map` key.
es: [R024](cli/indicators/R/024): Señalar al ganador y al oferente de la segunda oferta más baja. Agregar la clave `--map`.

source: [R035](cli/indicators/R/035): Flag the winner. Add `--map` key.
es: [R035](cli/indicators/R/035): Señalar al ganador. Agregar la clave `--map`.

source: Add global exclusion for cancelled `/tender/status`.
es: Agregar exclusión global para `/tender/status` cancelado.

source: Fixed
es: Corregido

source: If the first quartile, third quartile and interquartile range are 0, skip the indicator to not flag 75% of cases.
es: Si el primer cuartil, el tercer cuartil y el rango intercuartílico son 0, omitir el indicador para no señalar el 75% de los casos.

source: {doc}`cli/init` command:
es: comando {doc}`cli/init`:

source: Add `--force` (`-f`) option to overwrite an existing file.
es: Agregar opción `--force` (`-f`) para sobrescribir un archivo existente.

source: Add `--map` option to include the `Maps` key.
es: Agregar opción `--map` para incluir la clave `Maps`.

source: Add `--no-meta` option to omit the `Meta` key.
es: Agregar opción `--no-meta` para omitir la clave `Meta`.

source: [R038](cli/indicators/R/038): Add `minimum_submitted_bids` and `minimum_contracting_processes` configurations.
es: [R038](cli/indicators/R/038): Agregar configuraciones `minimum_submitted_bids` y `minimum_contracting_processes`.

source: Prefix an error about an unknown property in the settings file with the path at which it occurred.
es: Prefija un error sobre una propiedad desconocida en el archivo de configuración con la ruta en la que se produjo.

source: Add `currency` property to default file.
es: Agregar propiedad `currency` al archivo de configuración.

source: Improve write performance.
es: Mejora el rendimiento.

source: Add `Meta` key to assist interpretation of results.
es: Agregar clave `Meta` para asistir en la interpretación de los resultados.

source: The `--count` option writes to standard error instead of standard output, to not mix outputs.
es: La opción `--count` escribe en el error estándar en lugar de en la salida estándar, para no mezclar las salidas.

source: All `threshold` and `percentile` configurations are consistently interpreted as inclusive.
es: Todas las configuraciones de `threshold` y `percentile` se interpretan siempre como inclusivas.

source: Add `--output` (`-o`) and `--errors` (`-e`) options, instead of using shell redirection.
es: Agregar opciones `--output` (`-o`) y `--errors` (`-e`), en lugar de usar redirección de shell.

source: Fill in `/awards[]/items[]/classification/scheme` with `item_classification_scheme`.
es: Llenar `/awards[]/items[]/classification/scheme` con `item_classification_scheme`.

source: {doc}`cli/init` command.
es: comando {doc}`cli/init` :

source: {doc}`cli/prepare` command.
es: comando {doc}`cli/prepare` :

source: `[defaults]` section.
es: Sección de `[defaults]`.

source: `[codelists.*]` sections.
es: Sección de `[codelists.*]`.

source: [R025](cli/indicators/R/025) (*Excessive unsuccessful bids*).
es: [R025](cli/indicators/R/025) (*Número excesivo de ofertas no exitosas*).

source: [R036](cli/indicators/R/036) (*Lowest bid disqualified*).
es: [R036](cli/indicators/R/036) (*Oferta más baja descalificada*).

source: [R038](cli/indicators/R/038) (*Excessive disqualified bids*).
es: [R038](cli/indicators/R/038) (*Alto número de ofertas descalificadas*).

source: Expand documentation.
es: Expandir la documentación.

source: Error on unknown configurations in the settings file.
es: Error en configuraciones desconocidas en el archivo de configuración.

source: {ref}`Enable<enable-an-indicator>` indicators in the settings file.
es: {ref}`Habilitar<enable-an-indicator>` indicadores en el archivo de configuración.

source: Rename indicators from `NF###` to `R###`.
es: Renombrar indicadores de `NF###` a `R###`.

source: Remove "OCID" from output if no OCIDs reported.
es: Eliminar "OCID" de la salida si no hay OCIDs reportadas.

source: Split indicators into trait objects.
es: Dividir los indicadores en objetos trait.

source: Preserve top-level key order in the JSON output.
es: Conservar el orden de las claves de nivel superior en la salida JSON.

source: {doc}`cli/coverage` command:
es: comando {doc}`cli/coverage` :

source: Preserve JSON path key order in the JSON output.
es: Conservar el orden de las claves en la salida JSON.

source: Commands no longer error on `SIGPIPE` signal.
es: Los comandos ya no generan error con la señal `SIGPIPE`.

source: [R035](cli/indicators/R/035) (*All except winning bid disqualified*).
es: [R035](cli/indicators/R/035) (*Todas las ofertas son descalificadas excepto la ganadora*).

source: Add `--settings SETTINGS` option for the settings file.
es: Agregar opción `--settings SETTINGS` en el archivo de configuración

source: Add documentation.
es: Agregar la documentación.

source: First release, including:
es: Primer lanzamiento, incluyendo:

source: [R024](cli/indicators/R/024) (*Price close to winning bid*).
es: [R024](cli/indicators/R/024) (*Precio cercano a la oferta ganadora*).
